{
  "profile-title": "About",
  "profile-text": "<p>I was born and grew up in Brazil, in a small town at the center of the Bahia state. My experience with computers started when my parents, both hight school teachers, needed a computer to work. They bought a white IBM Windows 98 PC, which I played games and learned a lot from, enjoyed every second of it. Knowing that I would end up working with tech wasn't a stretch.</p><p>As time passes I started to study Computer Engineering to after find out that coding itself is what suits me more, so I make the change to Computer Science. In the meantime I learned the basics of Web Development and started making games and websites for fun, to later decide to do this professionally, and here I am. </p><p>My other big passions are Music, Crypto and Games.</p>",
  "profile-skills-title": "My Skills:",
  "profile-contact-title": "Contact:",
  "archive-title": "Blog Archive",
  "hero-title": "Selected Work",
  "page-1-title": "Bitcoin Glance",
  "page-1-page": "bitcoin-glance",
  "page-1-link": "https://www.bitcoinglance.cc/",
  "page-1-repo": "https://github.com/vorsakha/bitcoin-glance",
  "page-1-description": "Bitcoin Glance calculates Bitcoin market history to get a glance at the current conditions, depending on specific time frames.",
  "page-1-image": "glance",
  "page-1-challenges": "<li>Translated a indicator strategy to code by calculating data coming from Binance API according to the indicator specifications.</li><li>Built custom hooks to handle the data sourcing from websocket and REST API</li>",
  "page-2-title": "Save a Class",
  "page-2-page": "save-a-class",
  "page-2-link": "https://saveaclass.vercel.app/",
  "page-2-repo": "https://github.com/vorsakha/saveaclass",
  "page-2-description": "Nextjs App that grabs COD MW(2019) match history data and allow user to save a specific match class.",
  "page-2-image": "sac",
  "page-2-challenges": "<li>NextApiRequest - I had to find out how to merge some more types to the NextApiRequest for a piece of code that required it in strict typescript.</li><li>localStorage - had to write checks to localStorage availability due to server side rendering of nextjs Window, and document are not available on the server. This is why you'll run into these types of errors if you are trying to access window properties or document. In my case, I was persisting my authentication token to localStorage on the previous application. To avoid running into these undefined errors at compile and build time, you can run a simple check.</li><li>Font change tailwind - The \"extend\" functionality allows you to add your fonts alongside with the existing font utilities. Add a theme.extend.fontFamily section to the Tailwind config</li><li>ype safety with extraReducers - I was getting an error regarding putting a promise inside a redux state. Resolved it by searching through the redux toolkit documentation and correctly making \"action\" type safe.</li><li>non-serializable value was detected in the state - Was passing aixos whole result, that apart from data, it contains various other fields related to the request. Although i'm only saving data and not other fields, as the whole res object passes to the store.Via Redux Toolkit documentation, store can only receive \"serializable data\".\"Serializable\" means data that can only be written as text and converted back to the original object, without losing information. To resolve the issue I passed only response.data to the payload.</li>",
  "page-3-title": "andreitf.co",
  "page-3-page": "andreitf",
  "page-3-link": "https://andreitf.co/",
  "page-3-repo": "https://github.com/vorsakha/portfolio-gatsby",
  "page-3-description": "Portfolio and Blog.",
  "page-3-image": "TF",
  "page-3-challenges": "<li>Got more experience working with JAMStack(ContentfulCMS API).</li><li>Got more experience with PWA App.</li>",
  "page-4-title": "Untilt - Bug Tracker",
  "page-4-page": "untilt",
  "page-4-link": "https://untilt-bug-tracker.netlify.app/",
  "page-4-repo": "https://github.com/vorsakha/untilt",
  "page-4-description": "Untilt is an app that let you log bugs and assign them to a registered member. Once a bug is resolved, a member can mark it as such. Every member have a section of their assigned bugs and other with all bugs as well.",
  "page-4-image": "untilt",
  "page-4-challenges": "<li>Got experience working with Redux-Toolkit.</li><li>Alert system with Redux.</li><li>Nodejs and Express with Typescript.</li><li>Dynamic routes with Gatsbyjs</li>",
  "page-5-title": "Remoto",
  "page-5-page": "remoto",
  "page-5-repo": "https://github.com/vorsakha/remoto",
  "page-5-npm": "https://remoto.vercel.app",
  "page-5-description": "Remoto grabs remote dev job openings and arranges them in an easy visual way for users to go through.",
  "page-5-image": "remoto",
  "page-5-challenges": "<li>Got to learn more about data fetching and static generation in Next.js.</li><li>Reduced the calls being made to the API used by creating my own API and caching the results.</li>",
  "page-6-title": "Beast Modal",
  "page-6-page": "gatsby-plugin-beast-modal",
  "page-6-repo": "https://github.com/vorsakha/beast-modal",
  "page-6-npm": "https://www.npmjs.com/package/@tsaristbomba/gatsby-plugin-beast-modal",
  "page-6-description": "A Gatsby plugin for easy modal display with gatsby-plugin-image. It is used in the example image on this page.",
  "page-6-image": "default",
  "page-6-challenges": "<li>Learned how to build a Gatsby plugin.</li><li>Refactored to use the new official gatsby-image-plugin.</li><li>Refactored to Typescript.</li>"
}
