{
  "profile-title": "Sobre",
  "profile-text": "<p>Nasci e cresci no Brasil, em uma pequena cidade no centro do estado da Bahia. Minha experiência com computadores começou quando meus pais, ambos professores, precisaram de um computador para trabalhar. Eles compraram um PC IBM Windows 98 branco, com o qual eu joguei e aprendi muito, aproveitei cada segundo. Saber que acabaria trabalhando com tecnologia não era um exagero.</p><p>Com o passar do tempo comecei a estudar Engenharia da Computação para depois descobrir que código em si é o que mais me convém, então mudei para Ciência da Computação. Nesse ínterim aprendi o básico de Desenvolvimento Web e comecei a fazer jogos e sites para me divertir, para depois decidir fazer isso profissionalmente, e aqui estou.</p><p>Minhas outras grandes paixões são música, crypto e jogos.</p>",
  "profile-skills-title": "Habilidades:",
  "profile-contact-title": "Contato:",
  "archive-title": "Arquivo",
  "hero-title": "Projetos",
  "page-1-title": "Bitcoin Glance",
  "page-1-page": "bitcoin-glance",
  "page-1-link": "https://www.bitcoinglance.cc/",
  "page-1-repo": "https://github.com/vorsakha/bitcoin-glance",
  "page-1-description": "O Bitcoin Glance calcula o histórico de mercado do Bitcoin para obter uma visão geral das condições atuais, dependendo de prazos específicos.",
  "page-1-image": "glance",
  "page-1-challenges": "<li>Traduzi uma estratégia de indicador para código calculando dados provenientes da API Binance de acordo com as especificações do indicador.</li><li>Construí custom hooks pra ajudar na captura de dados tanto via websocket quanto REST API.</li>",
  "page-2-title": "Save a Class",
  "page-2-page": "save-a-class",
  "page-2-link": "https://saveaclass.vercel.app/",
  "page-2-repo": "https://github.com/vorsakha/saveaclass",
  "page-2-description": "Nextjs App que captura o match history do COD MW(2019) e permite o usuário salvar a classe de uma partida específica.",
  "page-2-image": "sac",
  "page-2-challenges": "<li>NextApiRequest - Eu tive que descobrir como funciona o merge de types(NextApiRequest) para um pedaço do código que exigia em typescript estrito.</li><li>localStorage - Tive que escrever verificações para a disponibilidade do localStorage devido à natureza server side rendering do nextjs, as propriedades window e document não estão disponíveis no server. No meu caso, eu estava persistindo meu token de autenticação no localStorage. Para evitar cair nesses erros na hora do build, fiz uma simples verificação de disponibilidade.</li><li>Mudança de font Tailwindcss - A funcionalidade \"extend\" permite adicionar fontes juntamente com as já existentes ultilidades do tailwind. Adicionei em theme.extend.fontFamily no arquivo de config do tailwindcss.</li><li>Type safety com extraReducers - Estava experienciando um erro a respeito de colocar uma promise dentro de um redux state. Resolvi procurando na documentação do Redux Toolkit e corretamente fazendo \"action\" type safe.</li><li>non-serializable value detectado no state - Estava passando todo o valor que Axios retornava, tirando \"data\", contém outros valores não relacionados com o request. Embora esteja apenas salvando \"data\" e não outros valores, o objeto response estava passando inteiramente pro store. Via documentação do Redux Toolkit, store só poderia receber \"serializable data\".\"Serializable\" significa que pode ser escrito como texto e convertido de volta para o objeto original, sem perder informações. Para resolver mandei response.data pro payload.</li>",
  "page-3-title": "andreitf.co",
  "page-3-page": "andreitf",
  "page-3-link": "https://andreitf.co/",
  "page-3-repo": "https://github.com/vorsakha/portfolio-gatsby",
  "page-3-description": "Portfolio e Blog.",
  "page-3-image": "TF",
  "page-3-challenges": "<li>Ganhei mais experiência trabalhando com JAMStack (ContentfulCMS).</li><li>Ganhei mais experiência trabalhando com PWA.</li>",
  "page-4-title": "Untilt - Bug Tracker",
  "page-4-page": "untilt",
  "page-4-link": "https://untilt-bug-tracker.netlify.app/",
  "page-4-repo": "https://github.com/vorsakha/untilt",
  "page-4-description": "Untilt é um app que permite que usuário logue bugs e os atribua a um membro registrado. Uma vez que o bug é resolvido, um membro pode marcar correspondentemente. Todo membro tem uma sessão com os seus bugs atribuídos e outra com todos os bugs.",
  "page-4-image": "untilt",
  "page-4-challenges": "<li>Ganhei experiência trabalhando com Redux-toolkit.</li><li>Ganhei mais experiência com Nodejs e Express com Typescript.</li><li>Dynamic routes com Gatsby.js</li>",
  "page-5-title": "Remoto",
  "page-5-page": "remoto",
  "page-5-repo": "https://github.com/vorsakha/remoto",
  "page-5-link": "https://remoto.vercel.app",
  "page-5-description": "Remoto captura vagas de trabalho para desenvolvedor remoto e organiza em uma forma visual e fácil para usuários acessarem.",
  "page-5-image": "remoto",
  "page-5-challenges": "<li>Aprendi mais sobre data fetching e geração de dados estáticos no Next.js.</li><li>Diminui a quantidade de chamadas na API ultilizada produzindo uma API própria, cacheando o resultado.",
  "page-6-title": "Beast Modal",
  "page-6-page": "gatsby-plugin-beast-modal",
  "page-6-repo": "https://github.com/vorsakha/beast-modal",
  "page-6-npm": "https://www.npmjs.com/package/@tsaristbomba/gatsby-plugin-beast-modal",
  "page-6-description": "Um plugin Gatsby para fácil display modal com usando gatsby-plugin-image. É usado na imagem exemplo nesta página.",
  "page-6-image": "default",
  "page-6-challenges": "<li>Aprendi a fazer um plugin Gatsby.</li><li>Refatorei para usar o novo plugin oficial de otimização de imagens do Gatsby.js.</li><li>Refatorei para ultilizar typescript.</li>"
}
